Repository: juvonKT/aac_app
Catalog: lib/l10n/intl_*.arb
Languages: ja, ms, ta, zh

# setting
source: Settings
ja: 設定
ms: Tetapan
ta: அமைப்புகள்
zh: 设置

source: User Guide
ja: ユーザーガイド
ms: Panduan Pengguna
ta: பயனர் வழிகாட்டி
zh: 用户指南

source: Language
ja: 言語
ms: Bahasa
ta: மொழி
zh: 语言

source: Colour Scheme
ja: テーマ
ms: Skema Warna
ta: நிறத் திட்டம்
zh: 配色方案

source: User A
ja: ユーザーA
ms: Pengguna A
ta: பயனர் A
zh: 用户A

source: User B
ja: ユーザーB
ms: Pengguna B
ta: பயனர் B
zh: 用户B

source: User C
ja: ユーザーC
ms: Pengguna C
ta: பயனர் C
zh: 用户C

source: Add Phrase
ja: フレーズを追加
ms: Tambah Frasa
ta: அணைப்பைச் சேர்
zh: 添加短语

source: New Phrase
ja: 新しいフレーズ
ms: Cipta Frasa Baharu
ta: புதிய அணைப்பை உருவாக்கு
zh: 新短语

source: Add Category
ja: カテゴリを追加
ms: Tambah Kategori
ta: வகையைச் சேர்
zh: 添加类别

source: New Category
ja: 新しいカテゴリ
ms: Cipta Kategori Baharu
ta: புதிய வகையை உருவாக்கு
zh: 新类别

source: Home
ja: ホーム
ms: Laman Utama
ta: முகப்பு
zh: 首页

# removeMessage
source: Hold to remove all
ja: 長押ししてすべて削除
ms: Tekan dan tahan untuk membuang semua
ta: அனைத்தையும் நீக்க திடு
zh: 按住以删除全部

source: Delete Category
ja: カテゴリを削除
ms: Padamkan Kategori
ta: வகையை நீக்கு
zh: 删除类别

# deleteCategoryConfirmation
source: Are you sure you want to delete the category '{category}' and all its phrases?
ja: カテゴリ '{category}' とそのすべてのフレーズを削除してもよろしいですか？
ms: Adakah anda pasti mahu memadamkan kategori '{category}' dan semua frasanya?
ta: '{category}' வகையையும் அதன் அனைத்து சொற்றொடர்களையும் நிச்சயமாக நீக்க விரும்புகிறீர்களா?
zh: 您确定要删除类别 '{category}' 及其所有短语吗？

source: Cancel
ja: キャンセル
ms: Batal
ta: ரத்து செய்
zh: 取消

source: Delete
ja: 削除
ms: Padam
ta: நீக்கு
zh: 删除

# categoryDeleted
source: Category '{category}' has been deleted
ja: カテゴリ'{category}'が削除されました
ms: Kategori '{category}' telah dipadamkan
ta: '{category}' வகை நீக்கப்பட்டது
zh: 类别 '{category}' 已被删除

source: Light
ja: ライト
ms: Terang
ta: லைட்
zh: 浅色

source: Dark
ja: ダーク
ms: Gelap
ta: டார்க்
zh: 深色

source: System
ja: システム
ms: Sistem
zh: 系统

# userGuideContent
source: User Guide Content Goes Here
ja: ユーザーガイドの内容がここに表示されます
ms: Kandungan Panduan Pengguna Di Sini
ta: பயனர் வழிகாட்டி உள்ளடக்கம் இங்கு வருகிறது
zh: 用户指南内容在这里

source: Add New User
ja: 新しいユーザーを追加
ms: Tambah Pengguna Baharu

source: Delete User
ja: ユーザーを削除
ms: Padam Pengguna

source: Welcome!
ja: ようこそ！
ms: Selamat Datang!

source: Enter your name
ja: あなたの名前を入力してください
ms: Masukkan nama anda

# addUserButton
source: AddUser
ja: ユーザーを追加
ms: Tambah Pengguna

# deletePhraseConfirmation
source: Are you sure you want to delete '{phrase}'?
ja: 本当に '{phrase}' を削除してもよろしいですか？
ms: Adakah anda pasti mahu memadam '{phrase}'?

source: Delete Phrase
ja: フレーズを削除
ms: Padam Frasa

source: Select User
ja: ユーザーを選択
ms: Pilih Pengguna

# deleteUserConfirmation
source: Are you sure you want to delete '{user}'?
ja: 本当に'{user}'を削除してもよろしいですか？
ms: Adakah anda pasti mahu memadamkan '{user}'?

source: Past
ja: 過去
ms: Lampau

source: Progressive
ja: 進行形
ms: Progresif

# purposeTitle
source: What is this app for?
ja: このアプリは何のためですか？
ms: Apa fungsi aplikasi ini?

# purposeContent
source: This app is designed to help users, especially those with communication challenges, construct sentences using predefined phrases. It also offers features like phrase suggestions, multiple languages, and text-to-speech to assist users in effective communication.
ja: このアプリは、特にコミュニケーションに課題を抱えるユーザーが、定義されたフレーズを使用して文を構築するのを助けるために設計されています。また、フレーズの提案、複数の言語、音声合成などの機能を提供し、ユーザーが効果的なコミュニケーションを行えるよう支援します。
ms: Aplikasi ini direka untuk membantu pengguna, terutamanya mereka yang mempunyai cabaran komunikasi, membina ayat menggunakan frasa yang telah ditetapkan. Ia juga menawarkan ciri seperti cadangan frasa, pelbagai bahasa, dan teks-ke-pidato untuk membantu pengguna dalam komunikasi yang berkesan.

# addUserTitle
source: How to Add a User
ja: ユーザーを追加する方法
ms: Cara Menambah Pengguna
zh: 如何添加用户

# addUserContent
source: 1. Navigate to the Settings page. 2. Tap the 'Add User' button. 3. Enter the userâ€™s name and save.
ja: 1. 設定ページに移動します。 2. 「ユーザーを追加」ボタンを押します。 3. ユーザーの名前を入力して保存します。
ms: 1. Pergi ke halaman Tetapan. 2. Tekan butang 'Tambah Pengguna'. 3. Masukkan nama pengguna dan simpan.
zh: 1. 转到设置页面。 2. 点击“添加用户”按钮。 3. 输入用户的名字并保存。

# deleteUserTitle
source: How to Delete a User
ja: ユーザーを削除する方法
ms: Cara Memadam Pengguna
zh: 如何删除用户

# deleteUserContent
source: 1. Navigate to the Settings page. 2. Select the user you wish to delete from the list. 3. Tap the 'Delete' button.
ja: 1. 設定ページに移動します。 2. リストから削除するユーザーを選択します。 3. 「削除」ボタンを押します。
ms: 1. Pergi ke halaman Tetapan. 2. Pilih pengguna yang ingin dipadam daripada senarai. 3. Tekan butang 'Padam'.
zh: 1. 转到设置页面。 2. 从列表中选择要删除的用户。 3. 点击“删除”按钮。

# changeLanguageTitle
source: How to Change Language
ja: 言語を変更する方法
ms: Cara Menukar Bahasa
zh: 如何更改语言

# changeLanguageContent
source: 1. Go to the Settings page. 2. Under 'Language Preferences,' select your preferred language from the dropdown. 3. The app will automatically switch to the selected language.
ja: 1. 設定ページに移動します。 2. 「言語の設定」で、ドロップダウンから希望の言語を選択します。 3. アプリが自動的に選択した言語に切り替わります。
ms: 1. Pergi ke halaman Tetapan. 2. Di bawah 'Pilihan Bahasa', pilih bahasa pilihan anda daripada senarai. 3. Aplikasi akan secara automatik menukar ke bahasa yang dipilih.
zh: 1. 转到设置页面。 2. 在“语言首选项”下，从下拉菜单中选择你喜欢的语言。 3. 应用程序将自动切换到所选语言。

# changeThemeTitle
source: How to Change the Theme
ja: テーマを変更する方法
ms: Cara Menukar Skema Warna
zh: 如何更改主题

# changeThemeContent
source: 1. Navigate to Settings. 2. Under 'Theme,' choose between light or dark mode.
ja: 1. 設定ページに移動します。 2. 「テーマ」から、ライトモードかダークモードを選択します。
ms: 1. Pergi ke halaman Tetapan. 2. Di bawah 'Skema Warna', pilih antara mod terang atau gelap.
zh: 1. 转到设置页面。 2. 在“主题”下，选择浅色或深色模式。

# usePhrasesTitle
source: How to Use Phrases
ja: フレーズを使用する方法
ms: Cara Menggunakan Frasa
zh: 如何使用短语

# usePhrasesContent
source: 1. Navigate to the main phrase screen. 2. Choose a category or start typing a phrase. 3. The app will suggest phrases based on what you've selected.
ja: 1. フレーズのメイン画面に移動します。 2. カテゴリを選択するか、フレーズを入力し始めます。 3. アプリは選択に基づいてフレーズを提案します。
ms: 1. Pergi ke skrin utama frasa. 2. Pilih kategori atau mula menaip frasa. 3. Aplikasi akan mencadangkan frasa berdasarkan apa yang anda pilih.
zh: 1. 转到短语主屏幕。 2. 选择一个类别或开始输入短语。 3. 应用程序会根据您的选择建议短语。

# addPhraseTitle
source: How to Add a New Phrase or Category
ja: 新しいフレーズまたはカテゴリを追加する方法
ms: Cara Menambah Frasa atau Kategori Baharu
zh: 如何添加新短语或类别

# addPhraseContent
source: 1. Go to the Settings page. 2. Tap 'Add Phrase' or 'Add Category.' 3. Enter the details and save.
ja: 1. 設定ページに移動します。 2. 「フレーズを追加」または「カテゴリを追加」を押します。 3. 詳細を入力して保存します。
ms: 1. Pergi ke halaman Tetapan. 2. Tekan 'Tambah Frasa' atau 'Tambah Kategori'. 3. Masukkan butiran dan simpan.
zh: 1. 转到设置页面。 2. 点击“添加短语”或“添加类别”。 3. 输入详细信息并保存。

# deletePhraseTitle
source: How to Delete a Phrase or Category
ja: フレーズまたはカテゴリを削除する方法
ms: Cara Memadam Frasa atau Kategori
zh: 如何删除短语或类别

# deletePhraseContent
source: 1. Navigate to the main phrase screen. 2. Long press on the category or phrase you want to delete. 3. A pop-up message will ask for confirmation. Select 'Delete' to remove it.
ja: 1. フレーズのメイン画面に移動します。 2. 削除したいカテゴリまたはフレーズを長押しします。 3. 確認を求めるポップアップメッセージが表示されます。「削除」を選択して削除します。
ms: 1. Pergi ke skrin utama frasa. 2. Tekan dan tahan kategori atau frasa yang ingin dipadam. 3. Mesej pop-up akan meminta pengesahan. Pilih 'Padam' untuk memadamnya.
zh: 1. 转到短语主屏幕。 2. 长按要删除的类别或短语。 3. 弹出消息将询问确认。选择“删除”以删除它。

# useTTSTitle
source: How to Use Text-to-Speech
ja: テキスト読み上げを使用する方法
ms: Cara Menggunakan Teks-ke-Ucapan
zh: 如何使用文本转语音

# useTTSContent
source: 1. On the phrase screen, select a phrase or sentence. 2. Tap the speaker icon to hear the phrase spoken aloud.
ja: 1. フレーズ画面で、フレーズまたは文を選択します。 2. スピーカーアイコンを押して、フレーズを読み上げます。
ms: 1. Di skrin frasa, pilih frasa atau ayat. 2. Tekan ikon pembesar suara untuk mendengar frasa tersebut dibacakan.
zh: 1. 在短语屏幕上，选择一个短语或句子。 2. 点击扬声器图标以听到该短语的语音输出。
